export default {
  projections: {
    БилетыE: {
      датаПокупки: {
        __caption__: 'Дата покупки'
      },
      времяПокупки: {
        __caption__: 'Время покупки'
      },
      датаПоездки: {
        __caption__: 'Дата поездки'
      },
      пунктОтпр: {
        __caption__: 'Пункт отправления'
      },
      пунктНазнач: {
        __caption__: 'Пункт назначения'
      },
      перевозчик: {
        __caption__: 'Наименование',
        наименование: {
          __caption__: 'Наименование'
        }
      },
      место: {
        __caption__: 'Место'
      },
      клиент_: {
        __caption__: 'Покупатель',
        фИО: {
          __caption__: 'ФИО покупателя'
        },
        банкСчет: {
          __caption__: 'Банковский счет'
        }
      },
      билетКасса: {
        __caption__: 'Билет касса',
        наименование: {
          __caption__: 'Место расчета'
        }
      }
    },
    БилетыL: {
      пунктОтпр: {
        __caption__: 'Пункт отпр'
      },
      датаПоездки: {
        __caption__: 'Дата поездки'
      },
      датаПокупки: {
        __caption__: 'Дата покупки'
      },
      место: {
        __caption__: 'Место'
      },
      пунктНазнач: {
        __caption__: 'Пункт назнач'
      },
      времяПокупки: {
        __caption__: 'Время покупки'
      },
      клиент_: {
        __caption__: 'Банк счет',
        банкСчет: {
          __caption__: 'Банк счет'
        },
        фИО: {
          __caption__: ''
        }
      },
      билетКасса: {
        __caption__: 'Наименование',
        наименование: {
          __caption__: 'Наименование'
        }
      },
      перевозчик: {
        __caption__: 'Наименование',
        наименование: {
          __caption__: 'Наименование'
        }
      }
    }
  },
  validations: {
    времяПокупки: {
      __caption__: 'Время покупки'
    },
    датаПоездки: {
      __caption__: 'Дата поездки'
    },
    датаПокупки: {
      __caption__: 'Дата покупки'
    },
    место: {
      __caption__: 'Место'
    },
    пунктНазнач: {
      __caption__: 'Пункт назначения'
    },
    пунктОтпр: {
      __caption__: 'Пункт отправления'
    },
    билетКасса: {
      __caption__: 'Билет касса'
    },
    клиент_: {
      __caption__: 'Покупатель'
    },
    перевозчик: {
      __caption__: 'Наименование'
    }
  }
};
